{
    "HomePage": {
        "welcome": "Welcome to ",
        "description": "Your robust starting point for modern web applications, built with Next.js v15 App Router and the latest best practices for 2025. Accelerate your development with a pre-configured, scalable foundation.",
        "getStarted": "Get Started",
        "learnMore": "Learn More",
        "why": "Why this template?",
        "reason1title": "Cutting-Edge Technologies",
        "reason1description": "Leverage Next.js v15 with the App Router, TypeScript, and modern styling conventions for a powerful and efficient development experience.",
        "reason2title": "Optimized for Performance",
        "reason2description": "Built with performance in mind, ensuring fast load times and a smooth user experience right out of the box.",
        "reason3title": "Best Practices Applied",
        "reason3description": "Incorporates industry-standard best practices for code quality, project structure, accessibility, and maintainability.",
        "reason4title": "Developer Friendly",
        "reason4description": "Configured with ESLint and Prettier for consistent code style, absolute imports for cleaner paths, and clear environment setup."
    },
    "Theme": {
        "toggleTheme": "Toggle theme",
        "light": "Light",
        "dark": "Dark",
        "system": "System"
    },
    "NotFound": {
        "title": "404 - Page Not Found",
        "description": "The page you're looking for doesn't exist.",
        "backHome": "Back to Home"
    },
    "Dashboard": {
        "title": "Component Dashboard",
        "description": "Explore all available UI components and their variants"
    },
    "About": {
        "title": "Full Stack Developer",
        "description": "Passionate developer with expertise in modern web technologies and best practices",
        "name": "Cardo",
        "aboutMe": {
            "title": "About Me",
            "content": "I'm a passionate full-stack developer with over 5 years of experience building modern web applications. I specialize in React, Next.js, TypeScript, and Node.js, with a focus on creating scalable, maintainable, and user-friendly solutions."
        },
        "experience": {
            "title": "Experience",
            "current": "Leading development of enterprise applications with focus on performance and scalability",
            "previous": "Built and maintained multiple client projects using modern web technologies"
        },
        "education": {
            "title": "Education"
        },
        "projects": {
            "title": "Projects",
            "template": "A comprehensive Next.js template with best practices for 2025",
            "ecommerce": "Full-stack e-commerce platform with payment integration",
            "taskapp": "Real-time task management application with collaborative features"
        },
        "contact": {
            "title": "Contact",
            "description": "Get in touch for collaborations or questions",
            "email": "Email",
            "location": "Location"
        }
    }
}
